# DS2500 Lesson6

Jan 31, 2023

### Content:
- Pandas
    - series
    - dataframe

### Admin:

In [1]:
len(set([1,2,1])) == 1

False

In [2]:
# standard deviation of the same number = 0
import numpy as np
np.array([1,1,2]).std() == 0
# give credit to student in section 2

False

# Pandas

Pandas is a python module which stores data in `pd.DataFrame` and `pd.Series` objects.

In [3]:
import seaborn as sns

# Example DataFrame:
# df stands for dataframe.  df_penguin is a dataframe of penguin data
df_penguin = sns.load_dataset('penguins')
df_penguin.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

In [4]:
# example series: the "s_" is a (personal) convention for variables which are series
s_bill_length_mm = df_penguin['bill_length_mm']

s_bill_length_mm

0      39.1
1      39.5
2      40.3
3       NaN
4      36.7
       ...
339     NaN
340    46.8
341    50.4
342    45.2
343    49.9
Name: bill_length_mm, Length: 344, dtype: float64


### `pd.DataFrame` are two-dimensional, `pd.Series` are one-dimensional

### If we already have `np.array()`, why do we need pandas?
- pandas supports non numeric data (strings for categorical data, for example)
- pandas supports reading / storing data from more formats
    - csv (spreadsheets)
- pandas more elegantly deals with missing data
- pandas handles indexing woes

You could do almost everything pandas does with numpy arrays ... but it'd be much more difficult to accomplish.

## Pandas Series

### building:
- building: default index
- building: custom index
- building: from a dict

In [5]:
# look at first 3 rows of dataframe (for reference)
df_penguin.head(3)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female

In [6]:
# each row, or column of dataframe is a series object
# below is first row of dataframe (more on iloc indexing later...)
# (remember: each row is a sample -> this is 1 penguin's data)
penguin0_series = df_penguin.iloc[0, :]
penguin0_series

species                 Adelie
island               Torgersen
bill_length_mm            39.1
bill_depth_mm             18.7
flipper_length_mm        181.0
body_mass_g             3750.0
sex                       Male
Name: 0, dtype: object

Pandas series contain a sequence of labelled data elements:
- penguin0's `species` is `Adelie`
- penguin0's `island` is `Torgersen`
- penguin0's `bill_length_mm` is `39.1` ...
- penguin0's `<index-name>` is `<corresponding-value>`

A series is quite similar to a dictionary ...

In [7]:
penguin0_dict = {'species': 'Adelie',
                 'island': 'Torgersen',
                 'bill_length_mm': 39.1,
                 'bill_depth_mm': 18.7,
                 'flipper_length_mm': 181.0,
                 'body_mass_g': 3750.0,
                 'sex': 'Male'}

In [8]:
import pandas as pd

# build a series from dict
penguin0_series = pd.Series(penguin0_dict)
penguin0_series

species                 Adelie
island               Torgersen
bill_length_mm            39.1
bill_depth_mm             18.7
flipper_length_mm        181.0
body_mass_g             3750.0
sex                       Male
dtype: object

In [9]:
# you can also pass two corresponding lists / tuples
index = ['species', 'island', 'bill_length_mm', 'bill_depth_mm', 'flipper_length_mm', 'body_mass_g', 'sex']
values = ['Adelie', 'Torgersen', 39.1, 18.7, 181.0, 3750.0, 'Male']

penguin0_series = pd.Series(values, index=index)
penguin0_series

species                 Adelie
island               Torgersen
bill_length_mm            39.1
bill_depth_mm             18.7
flipper_length_mm        181.0
body_mass_g             3750.0
sex                       Male
dtype: object

In [10]:
# sometimes your data has no meaningful index
# pandas will default to indexing things with integers
ice_cream_flavors = 'vanilla', 'chocolate', 'cherry garcia', 'oatmeal'
pd.Series(ice_cream_flavors)

0          vanilla
1        chocolate
2    cherry garcia
3          oatmeal
dtype: object

In [11]:
# you can access values as an array via .values
penguin0_series.values

array(['Adelie', 'Torgersen', 39.1, 18.7, 181.0, 3750.0, 'Male'],
      dtype=object)

In [12]:
# you can access index (as a special pandas "index" object) via .index
penguin0_series.index

Index(['species', 'island', 'bill_length_mm', 'bill_depth_mm',
       'flipper_length_mm', 'body_mass_g', 'sex'],
      dtype='object')

### indexing into `pd.Series`: accessing / changing data
- accessing / setting using index:
    - by name: `series.loc[name]`
    - by position: `series.iloc[idx]`
- iterating: keys, items, iteritems (much like dict)
- deleting an entry

In [13]:
dict_fav_num = {'matt': 6, 'riva': 7, 'eli': 11, 'zeke': 101}
series_fav_num = pd.Series(dict_fav_num)
series_fav_num

matt      6
riva      7
eli      11
zeke    101
dtype: int64

In [14]:
# lookup by position: get value in position 2 (third)
series_fav_num.iloc[2]

11

In [15]:
# lookup by index (name): get value associated with index='matt'
series_fav_num.loc['matt']

6

In [16]:
# you can also address directly into the series object to lookup by index
# (my mild preference nobody follows: avoid this ... a bit more ambiguous)
series_fav_num['matt']

6

In [17]:
# each of these access methods can also set the value
series_fav_num.iloc[2] = 1000
series_fav_num

matt       6
riva       7
eli     1000
zeke     101
dtype: int64

In [18]:
# check membership of item in index
'matt' in series_fav_num.index

True

In [19]:
'bob' in series_fav_num.index

False

In [20]:
1000 in series_fav_num.values

True

### Iterating through elements of a `pd.Series`

... pretty much the same as a dictionary except pandas uses an "index" while a dictionary has "keys".

In [21]:
# iterating through index (note: no parenthases around .index below)
for idx in series_fav_num.index:
    print(idx)

matt
riva
eli
zeke

In [22]:
# iterating through values (notice: no parenthases on .values belwo)
for val in series_fav_num.values:
    print(val)

6
7
1000
101

In [23]:
# iterating through index, value pairs (just like dict!)
for key, val in series_fav_num.items():
    print(key, val)

matt 6
riva 7
eli 1000
zeke 101

### Removing an element

In [24]:
# removing a pair by its corresponding index (just like dict!)
del series_fav_num['matt']

In [25]:
series_fav_num

riva       7
eli     1000
zeke     101
dtype: int64

### Examining a `pd.Series`

Just like numpy arrays:
- `Series.argmin()`
    - which index has smallest value
    - pandas gives the row number, not the index
- `Series.argmax()`
    - which index has largest value
    - pandas gives the row number, not the index
- `Series.mean()`
- `Series.min()`
- `Series.max()`
- `Series.std()`
- `Series.var()`

But wait, there's more!  These are in pandas objects but not numpy array
- `Series.count()`
    - number of item pairs in series
- `Series.value_counts()`
    - count of every unique value in series (like a histogram)
    - (see example below please)
- `Series.describe()`
    - summary statistics

In [28]:
dict_fav_num = {'matt': 6, 'riva': 7, 'eli': 11, 'zeke': 101, 'sally': 101}
series_fav_num = pd.Series(dict_fav_num)
series_fav_num

matt       6
riva       7
eli       11
zeke     101
sally    101
dtype: int64

### Our old friends from numpy

In [ ]:
# for reference
series_fav_num

In [ ]:
# our familiar friends ...
series_fav_num.min(), series_fav_num.max(), series_fav_num.std(), series_fav_num.var()

In [ ]:
# notice: pandas gives the position of the row with smallest value
# (one might think they'd get index 'matt' here instead)
series_fav_num.argmin()

In [ ]:
# index 0 (first entry) has the lowest favorite number
idx_min = series_fav_num.argmin()
series_fav_num.index[idx_min]

In [ ]:
# index 3 (last entry) has the highest favorite number
series_fav_num.argmax()

### New functionality, only in pandas

In [ ]:
series_fav_num

In [ ]:
# number of entries (rows)
series_fav_num.count()

In [ ]:
# how many times did each of the favorite numbers occur?
# (101 occurs twice in series_fav_num, while all other values occur once)
series_fav_num.value_counts()

In [ ]:
# describe is useful to get a sense of how values are distributed
# "50%" is equivilent to the median
# "25%"" indicates that 25% of data is less than this value (and 75% is greater)
series_fav_num.describe()

# Extracting a `pd.DataFrame` column as a series

A dataframe is a two dimensional table of data.  Each row or column is a series object.

In [ ]:
import seaborn as sns

# may take a 15 sec on first run to download titanic data
df_titanic = sns.load_dataset('titanic')
df_titanic.head()

In [ ]:
# get the age column of dataframe as a series
df_titanic['age']

## In Class Activity A

- `.describe()` how much people paid to get aboard the titanic.  
- count how many passengers of each age were on board
- change the price paid of the passenger in row index 2 (the 3rd row) to `123`
- each passenger corresponds to a row, what is the index of the passenger who paid the highest price?

In [29]:
import seaborn as sns

# may take a 15 sec on first run to download titanic data
df_titanic = sns.load_dataset('titanic')
df_titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [32]:
# describe() - how much people paid to get abroad
import pandas as pd

people = df_titanic.describe()
print(people.loc["count", "fare"])

# df_titanic["fare"].describe()

891.0

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: fare, dtype: float64

In [38]:
# count - how many passengers of each age
people = df_titanic.loc[:, "age"]
people.value_counts()

df_titanic['age'].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: age, Length: 88, dtype: int64

In [42]:
# change price in row index 2 (3rd row) to 123
people = df_titanic['fare'].loc[2] = 123
people
# df_titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,123.0000,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [54]:
# for each row, index of the passenger who paid the highest price

for idx in df_titanic['fare']:
    x = df_titanic['fare'].argmax()

print(x)

#df_tiantic['fare'].max()
df_titanic['fare'].argmax()

258

258

## Pandas: DataFrame

Remember:
- `Series`:  1d data object
- `DataFrame`: 2d data object

`DataFrame`s represent two-dimensional data, like the quiz scores from last class:

|           | Quiz 0 | Quiz 1 | Quiz 2 |
|-----------|--------|--------|--------|
| Student 0 | 80     | 90     | 50     |
| Student 1 | 87     | 92     | 80     |

Each column or row above could be considered a `Series` object

In [55]:
import pandas as pd
import numpy as np

quiz_array = np.array([[80, 90, 50],
                       [87, 92, 80]])

df_quiz = pd.DataFrame(quiz_array, 
                       columns=('quiz0', 'quiz1', 'quiz2'), 
                       index=('student0', 'student1'))
df_quiz

          quiz0  quiz1  quiz2
student0     80     90     50
student1     87     92     80

In [56]:
# we construct a dataframe as a dictionary
# keys of the dictionary are columns of dataframe
# values are lists (or tuples) of the values in each column
quiz_dict = {'quiz0': [80, 87],
            'quiz1': [90, 92],
            'quiz2': [50, 80]}
pd.DataFrame(quiz_dict, index=('student0', 3))

          quiz0  quiz1  quiz2
student0     80     90     50
3            87     92     80

In [57]:
# can we make dataframe without labelling rows / columns?
df_quiz = pd.DataFrame(quiz_array)
df_quiz

    0   1   2
0  80  90  50
1  87  92  80

In [58]:
# we can just add the names in afterwards if you'd like to
df_quiz.columns = ['quiz0', 'quiz1', 'quiz2']
df_quiz.index = ('student0', 'student1')
df_quiz

          quiz0  quiz1  quiz2
student0     80     90     50
student1     87     92     80

### Describing a `pd.DataFrame`

Just like numpy arrays:
- `DataFrame.argmin()`
    - which index has smallest value
    - pandas gives the row number, not the index
- `DataFrame.argmax()`
    - which index has largest value
    - pandas gives the row number, not the index
- `DataFrame.mean()`
- `DataFrame.min()`
- `DataFrame.max()`
- `DataFrame.std()`
- `DataFrame.var()`

New to pandas:
- `DataFrame.count()`
    - number of item pairs in series
- `DataFrame.describe()`
    - summary statistics
- `DataFrame.value_counts()`
    - count how many unique rows there are
    - see falcon / dog / cat example below please

In [59]:
df_quiz

          quiz0  quiz1  quiz2
student0     80     90     50
student1     87     92     80

In [60]:
# by default, each method applies operation to entire column of data
df_quiz.mean()

quiz0    83.5
quiz1    91.0
quiz2    65.0
dtype: float64

In [61]:
# we can also pass axis parameter to specify if operation should be applied to row or column
# !remember!
# axis=0 -> apply operation across all rows (returns operation per col)
# axis=1 -> apply operation across all cols (returns operation per row)
df_quiz.mean(axis=0)

quiz0    83.5
quiz1    91.0
quiz2    65.0
dtype: float64

In [62]:
# applies each operation to entire column of data (row)
df_quiz.mean(axis=1)

student0    73.333333
student1    86.333333
dtype: float64

### Take a moment to appreciate a panda:
Those labels on the pandas objects are super help in understanding the output immediately above, right?

(The `axis=0` vs `axis=1` stuff was easy to get turned around with in numpy)

In [63]:
df_quiz

          quiz0  quiz1  quiz2
student0     80     90     50
student1     87     92     80

In [64]:
# describe only works on columns (no axis param given)
df_quiz.describe()

           quiz0      quiz1      quiz2
count   2.000000   2.000000   2.000000
mean   83.500000  91.000000  65.000000
std     4.949747   1.414214  21.213203
min    80.000000  90.000000  50.000000
25%    81.750000  90.500000  57.500000
50%    83.500000  91.000000  65.000000
75%    85.250000  91.500000  72.500000
max    87.000000  92.000000  80.000000

In [65]:
# borrowing from pandas documentation for new example
df = pd.DataFrame({'num_legs': [2, 4, 4, 6],
                   'num_wings': [2, 0, 0, 0]},
                  index=['falcon', 'dog', 'cat', 'ant'])
df

        num_legs  num_wings
falcon         2          2
dog            4          0
cat            4          0
ant            6          0

In [66]:
# notice that value_counts() gives 
df.value_counts()

num_legs  num_wings
4         0            2
2         2            1
6         0            1
dtype: int64

`value_counts()` on a `pd.DataFrame` tells us how many times we observed each full row.  It tells us that `df` has:
- 2 row(s) in `df` with `num_legs=4, num_wings=0`  
- 1 row(s) in `df` with `num_legs=2, num_wings=2`
- 1 row(s) in `df` with `num_legs=6, num_wings=0`

## Indexing / Accessing a DataFrame
- indexing: 
    - `.loc[]` indexing by name of row or column
    - `.iloc[]` indexing by position integer (0, 1, 2, 3, 4 ...)
    & slicing & subsets
- using the slice operator `:` to get full rows or columns

In [67]:
quiz_dict = {'quiz0': [80, 87, 50, 89],
            'quiz1': [90, 92, 24, 85],
            'quiz2': [50, 80, 21, 40]}
df_quiz = pd.DataFrame(quiz_dict, index=('student0', 'student1', 'student2', 'student3'))
df_quiz

          quiz0  quiz1  quiz2
student0     80     90     50
student1     87     92     80
student2     50     24     21
student3     89     85     40

In [68]:
# indexing data by "name"
# remember: rows first, then columns ... 
# 1st entry describes which row ('student0')
# 2nd entry describes which col ('quiz0')

df_quiz.loc['student0', 'quiz0']

80

In [69]:
# index data by position
# 1st entry describes which row.  0 -> the 1st (topmost) row
# 2nd entry describes which col.  2 -> the 3rd (from the left) col
df_quiz.iloc[0, 2]

50

### you can use same slicing syntaxes on both .loc and .iloc

In [70]:
# get the column with idx 1 (second col)
df_quiz.iloc[:, 1]

student0    90
student1    92
student2    24
student3    85
Name: quiz1, dtype: int64

In [71]:
# 1st row, last col
df_quiz.iloc[0, -1]

50

In [72]:
# all rows, only quiz0
df_quiz.loc[:, 'quiz0']

student0    80
student1    87
student2    50
student3    89
Name: quiz0, dtype: int64

In [73]:
df_quiz

          quiz0  quiz1  quiz2
student0     80     90     50
student1     87     92     80
student2     50     24     21
student3     89     85     40

In [74]:
# slicing with named cols and rows
# you can get a range, by name of row/col
# note: this includes both start and stop columns (! unlike array / list)
df_quiz.loc['student0', 'quiz0':'quiz2' ]

quiz0    80
quiz1    90
quiz2    50
Name: student0, dtype: int64

In [75]:
# watch out:
# when you get ranges indexed by position: include start idx, exclude stop idx)
df_quiz.iloc[0, 0:2 ]

quiz0    80
quiz1    90
Name: student0, dtype: int64

In [76]:
# if you access directly into dataframe, it will assume you're looking for a column
# (below is equivilent to df_quiz.loc[:, 'quiz0'])
# mild preference: avoid this
df_quiz['quiz0']

student0    80
student1    87
student2    50
student3    89
Name: quiz0, dtype: int64

### I've seen someone use `pd.DataFrame.ix` to index like above, what does that do?

It was something of a hybrid between `.iloc` / `.loc` ... but it was weird to use.

[Please don't use it.](https://pandas.pydata.org/pandas-docs/version/0.23/generated/pandas.DataFrame.ix.html)

## Modifying a DataFrame
- updating values: single cell
- adding a new column or row

In [77]:
quiz_dict = {'quiz0': [80, 87, 50, 89],
            'quiz1': [90, 92, 24, 85],
            'quiz2': [50, 80, 21, 40]}
df_quiz = pd.DataFrame(quiz_dict, index=('student0', 'student1', 'student2', 'student3'))
df_quiz

          quiz0  quiz1  quiz2
student0     80     90     50
student1     87     92     80
student2     50     24     21
student3     89     85     40

In [78]:
# setting single entry in dataframe
df_quiz.loc['student0', 'quiz1'] = 123
df_quiz

          quiz0  quiz1  quiz2
student0     80    123     50
student1     87     92     80
student2     50     24     21
student3     89     85     40

In [79]:
# setting multiple (contiguous) entries in dataframe
df_quiz.loc['student0':'student1', 'quiz1': 'quiz2'] = 123, 456
df_quiz

          quiz0  quiz1  quiz2
student0     80    123    456
student1     87    123    456
student2     50     24     21
student3     89     85     40

In [80]:
# adding a new column (error prone handling of indexing ... which student got which grade?)
df_quiz['overall grade'] = 'a', 'b' , 'c', 'd'
df_quiz

          quiz0  quiz1  quiz2 overall grade
student0     80    123    456             a
student1     87    123    456             b
student2     50     24     21             c
student3     89     85     40             d

In [81]:
# delete a column
del df_quiz['overall grade']
df_quiz

          quiz0  quiz1  quiz2
student0     80    123    456
student1     87    123    456
student2     50     24     21
student3     89     85     40

In [82]:
# adding a column (next 2 cells) robust way of handling indexing
# by explicilty labelling the index we're sure to match more explicitly
s_overgrade = pd.Series({'student1': 'b-',                         
                         'student2': 'f (no quizzes taken)',
                         'student0': 'a+',
                         'student3': 'c'})
s_overgrade

student1                      b-
student2    f (no quizzes taken)
student0                      a+
student3                       c
dtype: object

In [83]:
# notice how pandas helps us out in aligning our new column with proper row
df_quiz.loc[: , 'overall grade'] = s_overgrade
df_quiz

          quiz0  quiz1  quiz2         overall grade
student0     80    123    456                    a+
student1     87    123    456                    b-
student2     50     24     21  f (no quizzes taken)
student3     89     85     40                     c

In [84]:
# how to 'drop' a row (returns a dataframe with row removed)
df_quiz_short = df_quiz.drop('student0')
df_quiz_short

          quiz0  quiz1  quiz2         overall grade
student1     87    123    456                    b-
student2     50     24     21  f (no quizzes taken)
student3     89     85     40                     c

In [85]:
# you can drop a column too by specifying `axis=1`
# (by default it uses axis=0 to drop rows)
df_quiz.drop('quiz0', axis=1)

          quiz1  quiz2         overall grade
student0    123    456                    a+
student1    123    456                    b-
student2     24     21  f (no quizzes taken)
student3     85     40                     c

## In Class Activity B
1. Build the following `df_grade`.  Be sure to include the row and column names:

|        | StudentB | StudentA | StudentC |
|-------:|----:|------:|------:|
| Quiz 1 |  89 |   100 |    78 |
| Quiz 2 |  75 |    90 |    90 |
| Quiz 3 |  93 |    85 |    65 |
| Quiz 4 |  92 |    92 |    76 |

1. index into this dataframe to build a `df_grade_subset`:
    - only includes rows studentB and studentC
    - only includes Quiz 2, Quiz 3, Quiz 4
1. Using the `df_grade_subset` from the step above:
    * calculate mean scores of studentB and studentC from the selected quizes
    * calculate mean score of each quiz 
        * (remember the `axis` parameter)
        
Operating on `df_grade`:
1. Add a new column `'StudentD'` with grades `60, 70, 80, 90` for quizes 1, 2, 3, 4 respectively
    * can you do this by adding a new `pd.Series` or `dict()` object?
1. Add a new row, `quiz5`, with any grades
1. Delete StudentC's column

In [96]:
# problem 1

# make df_grade chart
grade_dict = {'StudentB': [89, 75, 93, 92],
            'StudentA': [100, 90, 85, 92],
            'StudentC': [78, 90, 65, 76]}
df_grade = pd.DataFrame(grade_dict, index=('Quiz 1', 'Quiz 2', 'Quiz 3', 'Quiz 4'))
df_grade

        StudentB  StudentA  StudentC
Quiz 1        89       100        78
Quiz 2        75        90        90
Quiz 3        93        85        65
Quiz 4        92        92        76

In [170]:
# problem 1
# build subset
df_grade_subset = df_grade.iloc[1:4, 0:3:2]
df_grade_subset

        StudentB  StudentD
Quiz 2      75.0      70.0
Quiz 3      93.0      80.0
Quiz 4      92.0      90.0

In [150]:
# problem 2 using df_grade_subset
# calculate mean scores of studentB and student C
df_grade_subset.loc[: , :].mean()

StudentB    86.666667
StudentC    77.000000
dtype: float64

In [165]:
# problem 2 using df_grade_subset
# calculate mean of each quiz
df_grade_subset.mean(axis=1)

Quiz 2    82.5
Quiz 3    79.0
Quiz 4    84.0
dtype: float64

In [166]:
# problem 2 using df_grade
# add new column 'StudentD' with the grades
df_grade.loc[:, "StudentD"] = 60, 70, 80, 90
df_grade

        StudentB  StudentA  StudentC  StudentD
Quiz 1        89       100        78        60
Quiz 2        75        90        90        70
Quiz 3        93        85        65        80
Quiz 4        92        92        76        90

In [167]:
# problem 2 using df_grade
# add new row 
df_grade.loc["Quiz 5", :] = 88, 78, 94, 73
df_grade

        StudentB  StudentA  StudentC  StudentD
Quiz 1      89.0     100.0      78.0      60.0
Quiz 2      75.0      90.0      90.0      70.0
Quiz 3      93.0      85.0      65.0      80.0
Quiz 4      92.0      92.0      76.0      90.0
Quiz 5      88.0      78.0      94.0      73.0

In [168]:
# problem 2 using df_grade
# delete "studentC" column
del df_grade['StudentC']
df_grade

        StudentB  StudentA  StudentD
Quiz 1      89.0     100.0      60.0
Quiz 2      75.0      90.0      70.0
Quiz 3      93.0      85.0      80.0
Quiz 4      92.0      92.0      90.0
Quiz 5      88.0      78.0      73.0

### Operating on DataFrame & Series Objects

Your operators do pretty much what you'd expect them to.

In [ ]:
quiz_dict = {'quiz0': [80, 87],
            'quiz1': [90, 92],
            'quiz2': [50, 80]}
df_quiz = pd.DataFrame(quiz_dict, index=('student0', 'student1'))
df_quiz

In [ ]:
df_quiz * 1000

In [ ]:
# thats some extra credit ...
df_quiz.loc['student0', :] += 999999999999
df_quiz

In [ ]:
df_quiz

In [ ]:
# we can also use comparison operators (super helpful, see boolean indexing next)
df_quiz > 100

### Boolean Indexing into DataFrame

Sometimes we want to grab only the rows or columns which meet a particular condition.

"Get all students whose grade was higher than 85 on quiz 1"

In [ ]:
quiz_dict = {'quiz0': [80, 87, 60, 30],
            'quiz1': [90, 92, 60, 23],
            'quiz2': [50, 80, 70, 64]}
df_quiz = pd.DataFrame(quiz_dict, index=('student0', 'student1', 'student2', 'student3'))
df_quiz

In [ ]:
# quiz 1 is a series object which contains every index's quiz 1 grade
s_quiz1 = df_quiz.loc[:, 'quiz1']
s_quiz1

In [ ]:
# we create a series of booleans which is True only in the positions we're interested in
s_bool = s_quiz1 > 85
s_bool

In [ ]:
df_quiz

In [ ]:
# boolean indexing: using a boolean series as index returns only those entries which are True
# notice that since student2 & student3's quiz1 grade wasn't > 80 they aren't included below
df_quiz.loc[s_bool, :]

In [ ]:
df_quiz

In [ ]:
# what are all the students who get below a 70 on quiz1?
s_bool = df_quiz.loc[:, 'quiz1'] < 70
s_bool

In [ ]:
df_quiz.loc[s_bool, :]

In [ ]:
# we can build more complex conditions using 
# & (and operator)
# | (or operator)

# all students who got higher than 91 on quiz1 but didn't score higher than 90 on quiz2
s_bool = (df_quiz.loc[:, 'quiz1'] > 91) & (df_quiz.loc[:, 'quiz2']  <= 90)
s_bool

In [ ]:
df_quiz.loc[s_bool, :]

# One more thing, whats `pd.DataFrame.head()`?

It grabs the "head" (the first few rows) of a dataframe.  DataFrames can be so big that its overwhelming to look at the whole thing, sometimes a few rows is all thats needed.

In [ ]:
df_penguin = sns.load_dataset('penguins')
df_penguin.head()

In [ ]:
# DataFrame.head() takes an argument, the number of top rows to return
df_penguin.head(10)

## In Class Activity C
The `pclass` of a titanic ticket describes the passenger class.  Its unclear if larger or smaller `pclass` are the fancy tickets.

- `.describe()` the `fare` paid by passengers who bought `pclass=3` tickets
- `.describe()` the `fare` paid by passengers who bought `pclass=2` tickets
- `.describe()` the `fare` paid by passengers who bought `pclass=1` tickets

(++) You can use this boolean indexing to compare groups to answer all sorts of interesting questions:
- Survival Effectiveness: Were people who travelled alone more or less likely to survive the titanic?
- Demographics of towns: Which town, among Cherbourg, Queenstown or Southampton, seems to have the most families?
- Layout of the boat: Does having a higher or lower cabin number suggest one is more likely to have a higher or lower ticket class?
    - e.g. when `pclass=1` maybe these cabin numbers are all very large or small ...

Data dictionary ([not the primary source, but a source](https://jkarakas.github.io/Exploratory-Analysis-of-the-Titanic-Dataset/Titanic_Dataset_Exploratory_Analysis_No_Code.html))

| Variable | Definition                                 | Key                                           |
|----------|--------------------------------------------|-----------------------------------------------|
| Survived | Survival                                   | 0 = No, 1 = Yes                               |
| Pclass   | Ticket class                               | 1 = 1st, 2 = 2nd, 3 = 3rd                     |
| Sex      | Sex                                        |                                               |
| Age      | Age in years                               |                                               |
| Sibsp    | # of siblings / spouses aboard the Titanic |                                               |
| Parch    | # of parents / children aboard the Titanic |                                               |
| Ticket   | Ticket number                              |                                               |
| Fare     | Passenger fare                             |                                               |
| Cabin    | Cabin number                               |                                               |
| Embarked | Port of Embarkation                        | C = Cherbourg, Q = Queenstown,S = Southampton |

In [ ]:
df_titanic = sns.load_dataset('titanic')
df_titanic.head()